---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.HandRail
source: html/f313e6ad-e57a-2091-69e5-202f8fcab7d1.htm
---
# HandRail Properties

The id of the assembly instance to which the element belongs.